[
    {
        "image": "/images/app1.webp",
        "title": "PhotoSnap",
        "companyName": "PixelForge Ltd.",
        "id": 1,
        "description": [
            "PhotoSnap is a next-generation photo editing app designed for both creators and professionals who demand advanced yet accessible tools. Its AI-powered enhancement engine automatically adjusts lighting, tones, and color balance to make every photo pop instantly.",
            "The app includes a vast collection of artistic filters, cinematic overlays, and texture effects, allowing you to personalize your photos effortlessly. Batch editing and smart background removal make your workflow faster than ever.",
            "With its seamless cloud integration, PhotoSnap ensures your projects are always backed up and accessible across devices, redefining how mobile photo editing should feel."
        ],
        "size": 84,
        "reviews": 1256,
        "ratingAvg": 4.5,
        "downloads": "1M",
        "ratings": [
            {
                "name": "1 star",
                "count": 54
            },
            {
                "name": "2 star",
                "count": 83
            },
            {
                "name": "3 star",
                "count": 203
            },
            {
                "name": "4 star",
                "count": 562
            },
            {
                "name": "5 star",
                "count": 354
            }
        ]
    },
    {
        "image": "/images/app2.webp",
        "title": "TaskFlow",
        "companyName": "Nova Systems",
        "id": 2,
        "description": [
            "TaskFlow redefines productivity with its sleek interface and advanced task management features. Whether you're managing personal goals or team projects, the platform ensures seamless organization with drag-and-drop boards and smart scheduling.",
            "Integrated reminders, recurring tasks, and cross-device synchronization allow you to stay productive without missing a deadline. You can also track performance trends through dynamic visual reports.",
            "Built with collaboration in mind, TaskFlow connects teams through shared boards and comments, making remote work more effective and transparent."
        ],
        "size": 62,
        "reviews": 879,
        "ratingAvg": 4.2,
        "downloads": "870K",
        "ratings": [
            {
                "name": "1 star",
                "count": 42
            },
            {
                "name": "2 star",
                "count": 70
            },
            {
                "name": "3 star",
                "count": 180
            },
            {
                "name": "4 star",
                "count": 345
            },
            {
                "name": "5 star",
                "count": 242
            }
        ]
    },
    {
        "image": "/images/app3.webp",
        "title": "BeatWave",
        "companyName": "Soundify Studios",
        "id": 3,
        "description": [
            "BeatWave brings a complete music studio to your phone, empowering musicians to compose, mix, and publish high-quality tracks effortlessly. It features real-time beat generation, live waveform editing, and advanced layering tools for professionals.",
            "Whether you’re experimenting with rhythms or mastering your latest single, BeatWave’s smart tools make creativity flow naturally. Export your creations in lossless formats or share them instantly with the community.",
            "With plugin support and frequent sound library updates, BeatWave continues to evolve as a creative hub for artists worldwide."
        ],
        "size": 97,
        "reviews": 2301,
        "ratingAvg": 4.7,
        "downloads": "2M",
        "ratings": [
            {
                "name": "1 star",
                "count": 100
            },
            {
                "name": "2 star",
                "count": 150
            },
            {
                "name": "3 star",
                "count": 290
            },
            {
                "name": "4 star",
                "count": 760
            },
            {
                "name": "5 star",
                "count": 1001
            }
        ]
    },
    {
        "image": "/images/app4.webp",
        "title": "FitTrack",
        "companyName": "HealthPro",
        "id": 4,
        "description": [
            "FitTrack helps you take control of your health through smart workout tracking, calorie analysis, and personalized goal setting. Its AI-driven insights adapt to your body metrics, ensuring that every step you take moves you closer to your goals.",
            "The app includes guided exercises, sleep tracking, hydration reminders, and a nutrition planner to balance your lifestyle. With detailed graphs, you can visualize your progress and stay motivated.",
            "FitTrack transforms daily routines into long-term success with challenges, achievements, and community engagement that keeps fitness fun and consistent."
        ],
        "size": 55,
        "reviews": 1950,
        "ratingAvg": 4.3,
        "downloads": "980K",
        "ratings": [
            {
                "name": "1 star",
                "count": 130
            },
            {
                "name": "2 star",
                "count": 170
            },
            {
                "name": "3 star",
                "count": 400
            },
            {
                "name": "4 star",
                "count": 650
            },
            {
                "name": "5 star",
                "count": 600
            }
        ]
    },
    {
        "image": "/images/app5.webp",
        "title": "NoteMate",
        "companyName": "BrightApps Co.",
        "id": 5,
        "description": [
            "NoteMate is the all-in-one note-taking and organization tool that keeps your thoughts structured and accessible. With advanced text formatting, cloud sync, and offline support, it’s perfect for students, professionals, and creators alike.",
            "You can tag, color-code, and sort your notes, or attach images, audio, and files to capture ideas more completely. The voice note feature instantly converts speech into searchable text.",
            "NoteMate’s focus on simplicity and speed makes it a reliable companion for journaling, brainstorming, and daily planning."
        ],
        "size": 40,
        "reviews": 754,
        "ratingAvg": 4.1,
        "downloads": "600K",
        "ratings": [
            {
                "name": "1 star",
                "count": 60
            },
            {
                "name": "2 star",
                "count": 88
            },
            {
                "name": "3 star",
                "count": 180
            },
            {
                "name": "4 star",
                "count": 250
            },
            {
                "name": "5 star",
                "count": 176
            }
        ]
    },
    {
        "image": "/images/app6.webp",
        "title": "CookPal",
        "companyName": "TasteLab Inc.",
        "id": 6,
        "description": [
            "CookPal revolutionizes your kitchen with personalized recipe recommendations tailored to your ingredients and preferences. From quick snacks to gourmet dishes, it guides you step by step with easy-to-follow visuals and timers.",
            "The app can generate shopping lists, estimate meal costs, and offer substitution suggestions if you’re missing an ingredient. Integrated nutrition tracking ensures every meal supports your health goals.",
            "CookPal’s vibrant community allows users to share their creations, rate recipes, and discover inspiration from chefs around the world."
        ],
        "size": 70,
        "reviews": 1350,
        "ratingAvg": 4.6,
        "downloads": "1M",
        "ratings": [
            {
                "name": "1 star",
                "count": 85
            },
            {
                "name": "2 star",
                "count": 90
            },
            {
                "name": "3 star",
                "count": 250
            },
            {
                "name": "4 star",
                "count": 400
            },
            {
                "name": "5 star",
                "count": 525
            }
        ]
    },
    {
        "image": "/images/app7.webp",
        "title": "Travelio",
        "companyName": "WanderTech",
        "id": 7,
        "description": [
            "Travelio makes travel planning effortless with smart recommendations, itinerary generation, and real-time weather integration. It suggests destinations based on your preferences and budget, making trip planning stress-free.",
            "You can track expenses, book hotels, and even discover nearby attractions with augmented reality features. The built-in translator and offline maps make it a true global companion.",
            "Whether it’s a weekend getaway or a world tour, Travelio ensures you experience more and worry less."
        ],
        "size": 78,
        "reviews": 2109,
        "ratingAvg": 4.4,
        "downloads": "1M",
        "ratings": [
            {
                "name": "1 star",
                "count": 98
            },
            {
                "name": "2 star",
                "count": 120
            },
            {
                "name": "3 star",
                "count": 330
            },
            {
                "name": "4 star",
                "count": 750
            },
            {
                "name": "5 star",
                "count": 811
            }
        ]
    },
    {
        "image": "/images/app8.webp",
        "title": "Learnly",
        "companyName": "Eduverse Labs",
        "id": 8,
        "description": [
            "Learnly transforms learning into a personalized adventure. It features interactive lessons, quizzes, and challenges that adapt to your learning speed and style across a wide range of subjects.",
            "The app supports offline mode and offers progress tracking through visual dashboards. Earn achievements as you master topics and connect with mentors in live sessions.",
            "Designed for both students and professionals, Learnly empowers millions to upskill in a fun and engaging way."
        ],
        "size": 91,
        "reviews": 3200,
        "ratingAvg": 4.8,
        "downloads": "2M",
        "ratings": [
            {
                "name": "1 star",
                "count": 130
            },
            {
                "name": "2 star",
                "count": 140
            },
            {
                "name": "3 star",
                "count": 300
            },
            {
                "name": "4 star",
                "count": 890
            },
            {
                "name": "5 star",
                "count": 1740
            }
        ]
    }
]